Revit 2027 API
ParameterTypeId.WallStructuralSignificant Property
 "Structural"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallStructuralSignificant { get; }
Public Shared ReadOnly Property WallStructuralSignificant As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallStructuralSignificant {
	ForgeTypeId^ get ();
}
static member WallStructuralSignificant : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace